In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
grades = {"Atil": 50, "James": 60, "Lars": 30}

In [4]:
pd.Series(grades)

Atil     50
James    60
Lars     30
dtype: int64

In [5]:
names = ["Atil", "James", "Lars"]
grades = [50,60,30]

In [6]:
pd.Series(names, grades)

50     Atil
60    James
30     Lars
dtype: object

In [7]:
pd.Series(grades, names)

Atil     50
James    60
Lars     30
dtype: int64

In [8]:
#with numpy

In [9]:
numpyArray = np.array([50,60,30,20])

In [10]:
pd.Series(numpyArray)

0    50
1    60
2    30
3    20
dtype: int64

In [11]:
#arithmetic

In [12]:
contest_result1 = pd.Series(data = [10,5,100], index = ["Atil", "James", "Lars"])

In [13]:
contest_result2 = pd.Series(data = [20,50,10], index = ["Atil", "James", "Lars"])

In [14]:
contest_result1

Atil      10
James      5
Lars     100
dtype: int64

In [16]:
contest_result1["Atil"]

np.int64(10)

In [17]:
contest_result2["James"]

np.int64(50)

In [18]:
final_result = contest_result1 + contest_result2

In [19]:
final_result

Atil      30
James     55
Lars     110
dtype: int64

In [20]:
different_series1 = pd.Series(data = [20,30,40,50], index = ["a", "b", "c", "d"])

In [21]:
different_series2 = pd.Series([10,5,3,1], ["a", "c", "f", "g"])

In [22]:
different_series1 + different_series2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

In [23]:
data = np.random.randn(4,3)

In [24]:
data

array([[ 1.56414905, -0.56905796, -0.28273588],
       [ 0.35039056,  2.05038469,  0.30044774],
       [ 2.63188198,  1.6572324 ,  0.43825067],
       [-1.7575999 ,  0.14803606,  0.86793441]])

In [27]:
data_frame = pd.DataFrame(data)

In [28]:
data_frame

          0         1         2
0  1.564149 -0.569058 -0.282736
1  0.350391  2.050385  0.300448
2  2.631882  1.657232  0.438251
3 -1.757600  0.148036  0.867934

In [29]:
data_frame[0]

0    1.564149
1    0.350391
2    2.631882
3   -1.757600
Name: 0, dtype: float64

In [30]:
new_df = pd.DataFrame(data, index = ["Atil", "Zeynep", "Atlas", "Mehmet"], columns = ["Salary", "Age", "Seniority"])

In [31]:
new_df

          Salary       Age  Seniority
Atil    1.564149 -0.569058  -0.282736
Zeynep  0.350391  2.050385   0.300448
Atlas   2.631882  1.657232   0.438251
Mehmet -1.757600  0.148036   0.867934

In [32]:
new_df["Age"]

Atil     -0.569058
Zeynep    2.050385
Atlas     1.657232
Mehmet    0.148036
Name: Age, dtype: float64

In [33]:
new_df["Salary"]

Atil      1.564149
Zeynep    0.350391
Atlas     2.631882
Mehmet   -1.757600
Name: Salary, dtype: float64

In [34]:
new_df.loc["Atil"]

Salary       1.564149
Age         -0.569058
Seniority   -0.282736
Name: Atil, dtype: float64

In [35]:
new_df.iloc[0]

Salary       1.564149
Age         -0.569058
Seniority   -0.282736
Name: Atil, dtype: float64

In [36]:
new_df.iloc[1]

Salary       0.350391
Age          2.050385
Seniority    0.300448
Name: Zeynep, dtype: float64

In [37]:
new_df

          Salary       Age  Seniority
Atil    1.564149 -0.569058  -0.282736
Zeynep  0.350391  2.050385   0.300448
Atlas   2.631882  1.657232   0.438251
Mehmet -1.757600  0.148036   0.867934

In [38]:
new_df.iloc[:,2]

Atil     -0.282736
Zeynep    0.300448
Atlas     0.438251
Mehmet    0.867934
Name: Seniority, dtype: float64

In [39]:
new_df.iloc[3,2]

np.float64(0.8679344148986239)

In [40]:
#iloc kullanarak row, column mantığına erişebilirsin.

In [41]:
new_df["Extra"] = 10

In [42]:
new_df

          Salary       Age  Seniority  Extra
Atil    1.564149 -0.569058  -0.282736     10
Zeynep  0.350391  2.050385   0.300448     10
Atlas   2.631882  1.657232   0.438251     10
Mehmet -1.757600  0.148036   0.867934     10

In [44]:
new_df.drop("Extra", axis = 1)

          Salary       Age  Seniority
Atil    1.564149 -0.569058  -0.282736
Zeynep  0.350391  2.050385   0.300448
Atlas   2.631882  1.657232   0.438251
Mehmet -1.757600  0.148036   0.867934

In [45]:
new_df

          Salary       Age  Seniority  Extra
Atil    1.564149 -0.569058  -0.282736     10
Zeynep  0.350391  2.050385   0.300448     10
Atlas   2.631882  1.657232   0.438251     10
Mehmet -1.757600  0.148036   0.867934     10

In [46]:
new_df.drop("Extra", axis = 1, inplace= True)

In [47]:
new_df

          Salary       Age  Seniority
Atil    1.564149 -0.569058  -0.282736
Zeynep  0.350391  2.050385   0.300448
Atlas   2.631882  1.657232   0.438251
Mehmet -1.757600  0.148036   0.867934

In [48]:
new_df["Mehmet"] = 10

In [49]:
new_df

          Salary       Age  Seniority  Mehmet
Atil    1.564149 -0.569058  -0.282736      10
Zeynep  0.350391  2.050385   0.300448      10
Atlas   2.631882  1.657232   0.438251      10
Mehmet -1.757600  0.148036   0.867934      10

In [50]:
new_df.drop("Mehmet")

          Salary       Age  Seniority  Mehmet
Atil    1.564149 -0.569058  -0.282736      10
Zeynep  0.350391  2.050385   0.300448      10
Atlas   2.631882  1.657232   0.438251      10

In [51]:
new_df.drop("Mehmet", axis = 1, inplace = True)

In [52]:
new_df

          Salary       Age  Seniority
Atil    1.564149 -0.569058  -0.282736
Zeynep  0.350391  2.050385   0.300448
Atlas   2.631882  1.657232   0.438251
Mehmet -1.757600  0.148036   0.867934

In [53]:
new_df.loc["Atlas"]

Salary       2.631882
Age          1.657232
Seniority    0.438251
Name: Atlas, dtype: float64

In [54]:
new_df.loc["Atlas"]["Salary"]

np.float64(2.6318819767960835)

In [55]:
new_df.loc["Atlas", "Salary"]

np.float64(2.6318819767960835)

In [58]:
# iloc ile veriye erişmeye çalışırken sayı pozisyonları kullanılır
# loc ile veriye erişmeye çalışırken label lar kullanılır

In [59]:
new_df

          Salary       Age  Seniority
Atil    1.564149 -0.569058  -0.282736
Zeynep  0.350391  2.050385   0.300448
Atlas   2.631882  1.657232   0.438251
Mehmet -1.757600  0.148036   0.867934

In [60]:
new_df[new_df["Age"] > 0]

          Salary       Age  Seniority
Zeynep  0.350391  2.050385   0.300448
Atlas   2.631882  1.657232   0.438251
Mehmet -1.757600  0.148036   0.867934

In [61]:
new_df[new_df["Salary"] > 2]

         Salary       Age  Seniority
Atlas  2.631882  1.657232   0.438251

In [62]:
new_df.reset_index()

    index    Salary       Age  Seniority
0    Atil  1.564149 -0.569058  -0.282736
1  Zeynep  0.350391  2.050385   0.300448
2   Atlas  2.631882  1.657232   0.438251
3  Mehmet -1.757600  0.148036   0.867934

In [63]:
reset_frame = new_df.reset_index()

In [64]:
reset_frame

    index    Salary       Age  Seniority
0    Atil  1.564149 -0.569058  -0.282736
1  Zeynep  0.350391  2.050385   0.300448
2   Atlas  2.631882  1.657232   0.438251
3  Mehmet -1.757600  0.148036   0.867934

In [65]:
reset_frame.loc[0]

index            Atil
Salary       1.564149
Age         -0.569058
Seniority   -0.282736
Name: 0, dtype: object

In [66]:
new_indeces = ["Ati", "Zey", "Atl", "Meh"]

In [67]:
new_df["NewIndex"] = new_indeces

In [68]:
new_df

          Salary       Age  Seniority NewIndex
Atil    1.564149 -0.569058  -0.282736      Ati
Zeynep  0.350391  2.050385   0.300448      Zey
Atlas   2.631882  1.657232   0.438251      Atl
Mehmet -1.757600  0.148036   0.867934      Meh

In [69]:
new_df.set_index("NewIndex", inplace = True)

In [70]:
new_df

            Salary       Age  Seniority
NewIndex
Ati       1.564149 -0.569058  -0.282736
Zey       0.350391  2.050385   0.300448
Atl       2.631882  1.657232   0.438251
Meh      -1.757600  0.148036   0.867934

In [71]:
# multi-index

In [72]:
first_index = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [73]:
inner_index = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [74]:
zipped_index = list(zip(first_index, inner_index))

In [75]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [76]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [77]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [78]:
sample_values = np.ones((6,2))

In [79]:
big_df = pd.DataFrame(sample_values, index = zipped_index, columns = ["Age", "Salary"])

In [80]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [81]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [82]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0